[
  {
    "image": "/image/img1.png",
    "title": "NoteMaster",
    "companyName": "Three Blind Devs",
    "id": 101,
    "description": "A fast and intuitive note-taking app designed for students, professionals, and anyone who loves organized thoughts.",
    "detailedDescription": "NoteMaster revolutionizes digital note-taking with its lightning-fast performance and intuitive user interface. Designed specifically for students juggling multiple subjects and professionals managing complex projects, this app offers seamless organization through customizable notebooks, tags, and powerful search functionality. The rich text editor supports formatting, checklists, and embedded images, while the cloud sync ensures your notes are accessible across all devices. With features like voice-to-text conversion, handwriting recognition, and collaborative editing, NoteMaster enhances productivity for individual users and teams alike. The app's clean design reduces cognitive load, allowing you to focus on capturing ideas rather than navigating complicated menus. Advanced features include mathematical equation support, code syntax highlighting, and PDF annotation tools. Regular updates introduce new templates and integration with popular productivity tools, making it an essential companion for academic success and professional excellence in today's fast-paced digital world. The cross-platform compatibility ensures seamless transition between mobile and desktop environments.",
    "size": 18.5,
    "reviews": 1200,
    "ratingAvg": 4.3,
    "downloads": "50+",
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 80 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 470 }
    ]
  },
  {
    "image": "/image/img2.jpeg",
    "title": "FitTrack",
    "companyName": "FitTrack CCS",
    "id": 102,
    "description": "Track your daily fitness goals, monitor calories, and stay motivated with personalized health insights and reminders.",
    "detailedDescription": "FitTrack serves as your comprehensive digital fitness companion, offering sophisticated tracking capabilities for all aspects of your wellness journey. The app meticulously monitors daily activity levels, calorie intake, macronutrient distribution, and hydration while providing personalized recommendations based on your specific goals—whether weight loss, muscle gain, or maintenance. Its intelligent algorithm learns from your progress and adapts workout plans accordingly, ensuring continuous challenge and improvement. The integrated social features allow you to connect with friends for accountability and motivation, while achievement badges and milestone celebrations keep you engaged. With compatibility across major wearable devices and detailed analytics showing long-term trends, FitTrack transforms complex health data into actionable insights. The meditation and recovery tracking modules promote holistic wellbeing, making it more than just a fitness app but a complete lifestyle management solution for health-conscious individuals seeking sustainable results through data-driven approaches and community support systems.",
    "size": 25.2,
    "reviews": 980,
    "ratingAvg": 4.6,
    "downloads": "100+",
    "ratings": [
      { "name": "1 star", "count": 30 },
      { "name": "2 star", "count": 40 },
      { "name": "3 star", "count": 150 },
      { "name": "4 star", "count": 300 },
      { "name": "5 star", "count": 460 }
    ]
  },
  {
    "image": "/image/img3.png",
    "title": "BanglaLearn",
    "companyName": "Urva Apps",
    "id": 103,
    "description": "Learn Bangla interactively with lessons, quizzes, and audio support tailored for beginners and advanced learners alike.",
    "detailedDescription": "BanglaLearn represents a breakthrough in language learning technology, specifically designed to make mastering Bengali accessible and enjoyable for learners worldwide. The app combines structured curriculum with interactive exercises, covering everything from the Bengali alphabet and basic phrases to advanced grammar and conversational skills. Native speaker audio recordings ensure perfect pronunciation, while speech recognition technology provides instant feedback on your accent. The culturally contextual lessons incorporate Bangladeshi and West Bengali traditions, literature, and customs, offering deep cultural immersion alongside language acquisition. Adaptive learning algorithms identify your strengths and weaknesses, customizing lesson plans to maximize efficiency. With offline capability for learning on-the-go, progress tracking dashboards, and live tutoring sessions with certified instructors, BanglaLearn accommodates various learning styles and schedules. The comprehensive course library includes specialized modules for business communication, academic writing, and literary appreciation, making it suitable for diverse learning objectives and proficiency levels across global user base.",
    "size": 32.1,
    "reviews": 1240,
    "ratingAvg": 4.8,
    "downloads": "500k+",
    "ratings": [
      { "name": "1 star", "count": 20 },
      { "name": "2 star", "count": 30 },
      { "name": "3 star", "count": 100 },
      { "name": "4 star", "count": 600 },
      { "name": "5 star", "count": 1350 }
    ]
  },
  {
    "image": "/image/img4.jpeg",
    "title": "TaskFlow",
    "companyName": "Idee Programmer",
    "id": 104,
    "description": "Manage tasks, collaborate with teams, and track project progress using a clean and responsive interface.",
    "detailedDescription": "TaskFlow redefines project management through its elegantly simple yet powerfully capable platform that streamlines task organization and team collaboration. The application features intuitive drag-and-drop functionality for effortless task management, multiple project views including Kanban boards and Gantt charts, and smart automation that handles repetitive processes. Real-time collaboration tools enable seamless communication through comments, file sharing, and @mentions, while granular permission settings ensure appropriate access control across team members and stakeholders. Integration with popular calendar apps, email platforms, and cloud storage services creates a unified workspace that synchronizes all your productivity tools. Advanced reporting and analytics provide valuable insights into team performance and project bottlenecks, enabling data-driven decisions. With customizable templates for various industries and scalable architecture supporting everything from small teams to enterprise organizations, TaskFlow adapts to your specific workflow requirements, significantly enhancing efficiency through systematic organization and transparent communication channels across distributed teams.",
    "size": 20.0,
    "reviews": 860,
    "ratingAvg": 4.1,
    "downloads": "10+",
    "ratings": [
      { "name": "1 star", "count": 60 },
      { "name": "2 star", "count": 90 },
      { "name": "3 star", "count": 180 },
      { "name": "4 star", "count": 250 },
      { "name": "5 star", "count": 280 }
    ]
  },
  {
    "image": "/image/img5.png",
    "title": "PhotoSnap",
    "companyName": "PixelWorks",
    "id": 105,
    "description": "Edit photos with advanced filters, effects, and tools. Perfect for social media creators and photography lovers.",
    "detailedDescription": "PhotoSnap elevates mobile photography to professional standards with its comprehensive suite of editing tools and creative features. This powerful application provides advanced color correction, precision cropping, and layer-based editing capabilities that rival desktop software. The AI-powered enhancement tools automatically optimize lighting, contrast, and sharpness while preserving natural image quality. Creative professionals will appreciate the extensive filter library, customizable preset system, and advanced retouching tools for portrait perfection. The app supports high-resolution output and maintains EXIF data integrity throughout the editing process. Social media creators benefit from platform-specific aspect ratios, batch processing for multiple images, and direct sharing integration. Regular content updates introduce trending filters, seasonal overlays, and collaboration features for team projects. With its intuitive interface designed for both beginners and experts, PhotoSnap democratizes professional photo editing while maintaining the quality standards demanded by photography enthusiasts and content creators worldwide in the digital visual content landscape.",
    "size": 45.3,
    "reviews": 3000,
    "ratingAvg": 4.7,
    "downloads": "2M+",
    "ratings": [
      { "name": "1 star", "count": 40 },
      { "name": "2 star", "count": 60 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 700 },
      { "name": "5 star", "count": 1900 }
    ]
  },
  {
    "image": "/image/img6.jpeg",
    "title": "BudgetBuddy",
    "companyName": "Innovational App Labs",
    "id": 106,
    "description": "Track your expenses, set monthly budgets, and get smart financial tips to save more and spend wisely.",
    "detailedDescription": "BudgetBuddy transforms personal finance management through intelligent budgeting tools and actionable financial insights. The application automatically categorizes transactions from linked bank accounts and credit cards, providing real-time visibility into spending patterns across different categories. Customizable budget limits with alert systems prevent overspending while savings goals with progress tracking motivate consistent financial discipline. Advanced features include bill payment reminders, subscription management, and investment portfolio integration for comprehensive wealth management. The AI-powered financial assistant analyzes spending habits to identify saving opportunities and suggests optimized budget allocations based on income and financial objectives. Security remains paramount with bank-level encryption and biometric authentication protecting sensitive financial data. Detailed reports and visual analytics help users understand their financial health through charts, trends, and forecasting tools. Whether managing daily expenses, saving for major purchases, or planning long-term financial security, BudgetBuddy delivers the tools and insights necessary for achieving financial independence through informed decision-making and proactive money management strategies.",
    "size": 16.8,
    "reviews": 650,
    "ratingAvg": 4.0,
    "downloads": "50+",
    "ratings": [
      { "name": "1 star", "count": 70 },
      { "name": "2 star", "count": 100 },
      { "name": "3 star", "count": 150 },
      { "name": "4 star", "count": 180 },
      { "name": "5 star", "count": 150 }
    ]
  },
  {
    "image": "/image/img7.jpeg",
    "title": "CodeCraft",
    "companyName": "TinkerGen",
    "id": 107,
    "description": "Practice coding with challenges, tutorials, and real-world projects. Ideal for beginners and experienced developers.",
    "detailedDescription": "CodeCraft provides an immersive learning environment for programming education through its comprehensive curriculum and hands-on coding experience. The platform offers interactive coding exercises across multiple programming languages including Python, JavaScript, Java, and C++, with real-time error checking and debugging assistance. Beginners start with fundamental concepts through gamified lessons while advanced developers tackle complex algorithms and data structure challenges. The project-based learning approach allows users to build portfolio-worthy applications with guided tutorials and code review feedback. Integrated development environment features syntax highlighting, auto-completion, and version control integration for professional coding practice. The community aspect includes code collaboration, mentor matching, and participation in coding competitions. Regular content updates keep pace with industry trends, introducing new frameworks, libraries, and best practices. Whether pursuing career transition, skill enhancement, or competitive programming preparation, CodeCraft delivers structured learning pathways with measurable progress tracking and industry-recognized certification opportunities for aspiring and experienced developers in the rapidly evolving technology landscape.",
    "size": 22.4,
    "reviews": 1700,
    "ratingAvg": 4.5,
    "downloads": "1M+",
    "ratings": [
      { "name": "1 star", "count": 40 },
      { "name": "2 star", "count": 60 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 500 },
      { "name": "5 star", "count": 900 }
    ]
  },
  {
    "image": "/image/img8.png",
    "title": "TravelMate",
    "companyName": "S&A",
    "id": 108,
    "description": "Plan trips, book hotels, and explore destinations with curated guides and real-time travel updates.",
    "detailedDescription": "TravelMate revolutionizes travel planning and execution through its all-in-one platform that simplifies every aspect of journey preparation and experience. The application provides intelligent itinerary planning with drag-and-drop functionality, automatic scheduling optimization, and integration with transportation and accommodation booking services. Comprehensive destination guides include locally-curated recommendations, cultural insights, and safety information for informed travel decisions. Real-time updates cover flight status, weather conditions, and local events that might impact travel plans. The collaborative features enable group trip planning with shared itineraries and expense tracking for seamless coordination among travel companions. Offline functionality ensures access to critical travel information without internet connectivity, while emergency assistance features provide quick access to local services and embassy contacts. Personalized recommendations based on travel history and preferences enhance discovery of new destinations and experiences. From business trips to vacation adventures, TravelMate delivers peace of mind through organized planning, reliable information, and responsive support systems for modern travelers navigating domestic and international destinations.",
    "size": 28.9,
    "reviews": 1100,
    "ratingAvg": 4.2,
    "downloads": "1+",
    "ratings": [
      { "name": "1 star", "count": 55 },
      { "name": "2 star", "count": 85 },
      { "name": "3 star", "count": 250 },
      { "name": "4 star", "count": 300 },
      { "name": "5 star", "count": 410 }
    ]
  },
  {
    "image": "/image/img1.png",
    "title": "MindEase",
    "companyName": "CalmNest Studios",
    "id": 109,
    "description": "Meditation and mindfulness app with guided sessions, sleep sounds, and stress relief tools.",
    "detailedDescription": "MindEase offers a comprehensive mental wellness platform designed to help users manage stress, improve sleep quality, and cultivate mindfulness through evidence-based techniques. The app features an extensive library of guided meditation sessions ranging from beginner-friendly introductions to advanced practices, all led by certified meditation instructors and mental health professionals. Sleep enhancement tools include curated soundscapes, bedtime stories, and breathing exercises specifically designed to promote restful sleep. The mood tracking functionality allows users to monitor emotional patterns and identify triggers, while personalized recommendations adapt to individual needs and progress. Scientific approaches incorporate cognitive behavioral therapy principles, mindfulness-based stress reduction techniques, and biofeedback integration for holistic mental health support. Community features enable connection with like-minded individuals while maintaining privacy and personal boundaries. With content available for various durations and specific situations—from quick anxiety relief to extended relaxation sessions—MindEase accommodates diverse lifestyles and mental wellness goals, making professional-grade mental health support accessible to everyone seeking emotional balance and improved quality of life.",
    "size": 34.7,
    "reviews": 2100,
    "ratingAvg": 4.6,
    "downloads": "1M+",
    "ratings": [
      { "name": "1 star", "count": 45 },
      { "name": "2 star", "count": 70 },
      { "name": "3 star", "count": 250 },
      { "name": "4 star", "count": 600 },
      { "name": "5 star", "count": 1135 }
    ]
  },
  {
    "image": "/image/img2.jpeg",
    "title": "EduSpark",
    "companyName": "BrightLearn Inc.",
    "id": 110,
    "description": "Interactive learning platform for school students with video lessons, quizzes, and progress tracking.",
    "detailedDescription": "EduSpark transforms traditional education through its engaging digital learning platform that makes academic subjects come alive for K-12 students. The application offers curriculum-aligned content across mathematics, sciences, languages, and social studies, presented through high-quality video lessons, interactive simulations, and gamified learning activities. Adaptive learning technology assesses individual student proficiency and customizes lesson difficulty to ensure optimal challenge and knowledge retention. Comprehensive assessment tools include practice quizzes, chapter tests, and mock examinations with detailed performance analytics that identify knowledge gaps and learning patterns. The parent portal provides visibility into student progress, attendance, and achievement metrics, facilitating informed support and encouragement. Teacher resources enable classroom integration with assignment creation, student monitoring, and learning outcome measurement. Collaborative features allow peer-to-peer learning through study groups and discussion forums moderated by educational experts. By combining educational best practices with cutting-edge technology, EduSpark creates an immersive learning environment that supplements formal education, builds academic confidence, and fosters genuine curiosity across diverse subject areas for comprehensive student development.",
    "size": 40.2,
    "reviews": 1850,
    "ratingAvg": 4.4,
    "downloads": "500k+",
    "ratings": [
      { "name": "1 star", "count": 60 },
      { "name": "2 star", "count": 90 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 700 },
      { "name": "5 star", "count": 700 }
    ]
  },
  {
    "image": "/image/img3.png",
    "title": "QuickScan",
    "companyName": "DocuTech Labs",
    "id": 111,
    "description": "Scan documents, receipts, and notes with high-quality output and instant PDF conversion.",
    "detailedDescription": "QuickScan redefines mobile document scanning through its advanced optical character recognition technology and professional-grade output quality. The application transforms smartphone cameras into powerful scanning tools capable of capturing documents, receipts, business cards, and whiteboard notes with exceptional clarity. Intelligent edge detection automatically identifies document boundaries and corrects perspective distortion, while enhancement algorithms improve text sharpness, remove shadows, and optimize contrast for readable results. The OCR engine accurately converts scanned images into searchable and editable text across multiple languages, with formatting preservation for tables and complex layouts. Organization features include automatic filing based on content type, custom folder structures, and tagging systems for efficient document retrieval. Integration with cloud storage services enables seamless synchronization across devices and secure backup of important documents. Business-oriented features support batch processing, digital signature addition, and password protection for sensitive files. From students digitizing lecture notes to professionals managing paperwork, QuickScan delivers enterprise-level document management capabilities in a user-friendly mobile application that streamlines paperwork and reduces physical storage needs.",
    "size": 19.3,
    "reviews": 950,
    "ratingAvg": 4.3,
    "downloads": "100k+",
    "ratings": [
      { "name": "1 star", "count": 35 },
      { "name": "2 star", "count": 60 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 300 },
      { "name": "5 star", "count": 355 }
    ]
  },
  {
    "image": "/image/img4.jpeg",
    "title": "RecipeRealm",
    "companyName": "KitchenVerse",
    "id": 112,
    "description": "Discover and save recipes from around the world with step-by-step instructions and video support.",
    "detailedDescription": "RecipeRealm serves as your global culinary companion, offering access to thousands of authentic recipes from diverse cuisines and cultural traditions. The application features meticulously tested recipes with precise measurements, step-by-step photographic guides, and instructional videos demonstrating techniques from professional chefs. Advanced search and filtering capabilities allow discovery based on ingredients, dietary restrictions, cooking time, and difficulty level. Meal planning tools help organize weekly menus with automatic grocery list generation and inventory management that suggests recipes based on available ingredients. The social cooking community enables recipe sharing, rating systems, and connection with food enthusiasts worldwide. Nutritional information calculators provide detailed breakdowns of calories, macronutrients, and allergen content for informed dietary choices. Smart kitchen integration offers timer synchronization, temperature monitoring, and voice-controlled instructions for hands-free cooking. Seasonal collections, holiday specials, and chef-curated menus keep content fresh and relevant throughout the year. Whether exploring new cuisines or perfecting family favorites, RecipeRealm transforms cooking from routine task to creative adventure while building culinary confidence and expanding gastronomic horizons for home cooks of all experience levels.",
    "size": 36.5,
    "reviews": 2200,
    "ratingAvg": 4.7,
    "downloads": "2M+",
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 70 },
      { "name": "3 star", "count": 280 },
      { "name": "4 star", "count": 600 },
      { "name": "5 star", "count": 1200 }
    ]
  },
  {
    "image": "/image/img5.png",
    "title": "LangBridge",
    "companyName": "PolyLingua",
    "id": 113,
    "description": "Learn multiple languages with AI-powered lessons, speech practice, and cultural tips.",
    "detailedDescription": "LangBridge pioneers next-generation language acquisition through its artificial intelligence-driven platform that adapts to individual learning patterns and objectives. The application offers comprehensive courses in over twenty languages, from widely spoken ones like Spanish and Mandarin to less commonly taught languages, all developed by linguistic experts and native speakers. The AI tutor provides personalized lesson plans, identifies recurring error patterns, and focuses practice on challenging areas for accelerated progress. Speech recognition technology delivers instant pronunciation feedback with visual mouth position guides and intonation patterns. Cultural immersion modules incorporate authentic materials like news articles, music, and film clips to build contextual understanding beyond vocabulary and grammar. The conversation practice feature connects learners with native speakers for real-time dialogue in controlled environments with translation support. Spaced repetition algorithms optimize vocabulary retention while progress analytics track fluency development across reading, writing, listening, and speaking competencies. Whether preparing for travel, business communication, or personal enrichment, LangBridge delivers effective language learning through scientifically-backed methodologies and technological innovation that makes mastering new languages accessible, engaging, and culturally relevant for global citizens.",
    "size": 38.0,
    "reviews": 1950,
    "ratingAvg": 4.5,
    "downloads": "1M+",
    "ratings": [
      { "name": "1 star", "count": 40 },
      { "name": "2 star", "count": 80 },
      { "name": "3 star", "count": 250 },
      { "name": "4 star", "count": 600 },
      { "name": "5 star", "count": 980 }
    ]
  },
  {
    "image": "/image/img6.jpeg",
    "title": "ShopSmart",
    "companyName": "RetailGenie",
    "id": 114,
    "description": "Compare prices, find deals, and track discounts across thousands of online stores.",
    "detailedDescription": "ShopSmart empowers consumers with intelligent shopping tools that ensure they always get the best value for their purchases. The application continuously monitors prices across thousands of online retailers, providing real-time comparisons and price history graphs that reveal optimal buying timing. Deal alert systems notify users when desired products reach target prices or when limited-time promotions become available. The universal wish list functionality tracks items across different retailers and suggests alternative options with similar features at better price points. Cashback and reward programs automatically apply available discounts during checkout while tracking pending and earned rewards in a centralized dashboard. Product research features aggregate reviews from multiple sources, highlight key specifications, and identify common issues reported by other consumers. Budget tracking tools help manage shopping expenses with category limits and spending alerts to prevent impulse purchases. Browser extension integration enables automatic coupon application and price comparison while shopping on regular e-commerce websites. From everyday essentials to major investments, ShopSmart transforms the shopping experience from guesswork to data-driven decision making, saving both time and money while ensuring consumer satisfaction through informed purchasing choices.",
    "size": 27.8,
    "reviews": 1400,
    "ratingAvg": 4.2,
    "downloads": "500k+",
    "ratings": [
      { "name": "1 star", "count": 55 },
      { "name": "2 star", "count": 90 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 555 }
    ]
  },
  {
    "image": "/image/img7.jpeg",
    "title": "DailyJournal",
    "companyName": "MindLogix",
    "id": 115,
    "description": "Capture your thoughts, moods, and reflections with customizable templates and privacy lock.",
    "detailedDescription": "DailyJournal provides a secure digital sanctuary for personal reflection, emotional processing, and memory preservation through its thoughtfully designed journaling platform. The application offers multiple journaling approaches including traditional free-form writing, guided prompts for introspection, gratitude logging, and bullet journal-style rapid logging. Mood tracking features correlate emotional patterns with activities, weather, and social interactions to identify wellbeing influencers. Customizable templates cater to specific journaling purposes like dream recording, travel memories, project planning, or creative writing. Advanced organization systems use tags, searchable content, and chronological browsing to easily locate past entries. Privacy protection includes biometric authentication, local encryption, and hidden journal options for sensitive content. Multimedia support allows enrichment of entries with photographs, voice recordings, and location data for comprehensive memory capturing. Export functionality enables printing beautiful hardcover books from digital entries or creating backup archives. Reflection tools provide statistical insights into writing habits, mood trends, and frequently mentioned topics. By combining the therapeutic benefits of traditional journaling with digital convenience, DailyJournal fosters self-awareness, emotional intelligence, and meaningful life documentation for users seeking deeper understanding of their personal journey and growth.",
    "size": 21.5,
    "reviews": 870,
    "ratingAvg": 4.3,
    "downloads": "100k+",
    "ratings": [
      { "name": "1 star", "count": 30 },
      { "name": "2 star", "count": 60 },
      { "name": "3 star", "count": 180 },
      { "name": "4 star", "count": 300 },
      { "name": "5 star", "count": 300 }
    ]
  },
  {
    "image": "/image/img8.png",
    "title": "CryptoPulse",
    "companyName": "BlockWave",
    "id": 116,
    "description": "Track cryptocurrency prices, news, and portfolio performance in real-time.",
    "detailedDescription": "CryptoPulse delivers comprehensive cryptocurrency market intelligence through its real-time tracking platform designed for both novice investors and experienced traders. The application monitors thousands of digital assets across multiple exchanges, providing live price data, trading volume analysis, and market capitalization metrics. Portfolio tracking functionality automatically syncs with exchange APIs and wallet addresses to calculate accurate profit/loss statements with tax reporting preparation features. Advanced charting tools offer technical analysis capabilities with customizable indicators, drawing tools, and multiple timeframe comparisons. News aggregation curates relevant cryptocurrency developments from trusted sources worldwide, with sentiment analysis that gauges market impact. Alert systems notify users of significant price movements, volume spikes, or technical pattern formations based on personalized thresholds. Educational resources explain blockchain technology, investment strategies, and market dynamics for continuous learning. Security features include encrypted data storage, two-factor authentication, and privacy-focused design that never stores exchange credentials. Community sentiment tracking analyzes social media trends and developer activity to identify emerging opportunities. In the volatile cryptocurrency landscape, CryptoPulse provides the reliable data, analytical tools, and timely information necessary for informed investment decisions and portfolio management in the dynamic digital asset ecosystem.",
    "size": 29.4,
    "reviews": 1600,
    "ratingAvg": 4.4,
    "downloads": "1M+",
    "ratings": [
      { "name": "1 star", "count": 45 },
      { "name": "2 star", "count": 70 },
      { "name": "3 star", "count": 250 },
      { "name": "4 star", "count": 500 },
      { "name": "5 star", "count": 735 }
    ]
  },
  {
    "image": "/image/img16.png",
    "title": "SketchPad",
    "companyName": "Artify Studio",
    "id": 117,
    "description": "Draw, sketch, and paint with intuitive tools and layers for digital artists and hobbyists.",
    "detailedDescription": "SketchPad brings professional-grade digital art creation to mobile devices with its comprehensive suite of drawing tools and intuitive interface designed for artists of all skill levels. The application features pressure-sensitive brush engines that respond to stylus input with natural media emulation, replicating the behavior of pencils, inks, paints, and markers. Layer management supports blending modes, opacity controls, and grouping functionality for complex compositions. The extensive brush library includes customizable settings for texture, spacing, and dynamics, with community sharing for user-created brush packs. Color management tools offer harmonic palettes, gradient editors, and advanced mixing capabilities with support for multiple color models. Transform tools enable non-destructive scaling, rotation, and distortion with perspective correction guides. Time-lapse recording automatically documents the creative process for sharing or educational purposes. Cloud synchronization ensures artwork is securely backed up and accessible across devices, while export options support industry-standard formats with customizable resolution settings. For digital art enthusiasts, illustrators, and concept artists, SketchPad provides a portable studio that combines the spontaneity of traditional sketching with the versatility of digital tools, unleashing creativity anywhere inspiration strikes.",
    "size": 42.0,
    "reviews": 2400,
    "ratingAvg": 4.6,
    "downloads": "2M+",
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 80 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 700 },
      { "name": "5 star", "count": 1270 }
    ]
  },
  {
    "image": "/image/img17.jpeg",
    "title": "GreenSteps",
    "companyName": "EcoTrack",
    "id": 118,
    "description": "Monitor your carbon footprint, earn eco-points, and get tips for sustainable living.",
    "detailedDescription": "GreenSteps empowers individuals to make meaningful environmental contributions through its comprehensive sustainability tracking and education platform. The application calculates personal carbon footprint based on transportation habits, energy consumption, dietary choices, and purchasing patterns, providing clear visualization of environmental impact. Action plans suggest achievable steps for reducing footprint across different lifestyle areas with estimated impact measurements. The achievement system rewards sustainable behaviors with eco-points that can be redeemed for planting trees, supporting environmental organizations, or accessing premium content. Community challenges foster collective action through group goals and neighborhood initiatives that amplify individual efforts. Product scanning functionality evaluates environmental credentials of consumer goods, suggesting greener alternatives with detailed comparison metrics. Educational content explains complex environmental concepts in accessible terms, connecting personal actions to global impact. Partnership with verified environmental projects enables direct contribution to reforestation, clean energy development, and conservation efforts. Progress analytics track long-term sustainability journey with milestone celebrations and personalized encouragement. In addressing the urgent challenge of climate change, GreenSteps makes environmental responsibility engaging, measurable, and socially rewarding, transforming abstract concerns into concrete actions that collectively create significant positive impact for planetary health.",
    "size": 24.6,
    "reviews": 920,
    "ratingAvg": 4.2,
    "downloads": "100k+",
    "ratings": [
      { "name": "1 star", "count": 40 },
      { "name": "2 star", "count": 70 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 300 },
      { "name": "5 star", "count": 310 }
    ]
  },
  {
    "image": "/image/img18.png",
    "title": "VoiceNote Pro",
    "companyName": "SpeakSoft",
    "id": 119,
    "description": "Record voice notes, transcribe audio, and organize recordings with tags and folders.",
    "detailedDescription": "VoiceNote Pro revolutionizes audio recording and management through its sophisticated platform that captures, transcribes, and organizes spoken content with exceptional accuracy and efficiency. The application features studio-quality recording capabilities with noise reduction algorithms that ensure clarity even in challenging acoustic environments. Automatic speech recognition technology converts recordings into searchable text with speaker identification that distinguishes multiple voices in conversation. Organization systems use smart folders, custom tags, and priority ratings for effortless retrieval of important recordings. Editing tools allow trimming, splitting, and merging audio files with non-destructive editing that preserves original recordings. Cloud synchronization ensures recordings are securely backed up and accessible across all devices, with version history for important edits. Integration with productivity platforms enables direct sending of transcriptions to email, task managers, and note-taking applications. Background recording capability captures meetings, lectures, and interviews discreetly while the device screen is off. For professionals, students, journalists, and anyone who relies on verbal information, VoiceNote Pro transforms ephemeral speech into organized, searchable, and actionable content that enhances productivity, preserves important information, and unlocks the full potential of audio recording in personal and professional contexts.",
    "size": 20.9,
    "reviews": 1100,
    "ratingAvg": 4.3,
    "downloads": "500k+",
    "ratings": [
      { "name": "1 star", "count": 35 },
      { "name": "2 star", "count": 60 },
      { "name": "3 star", "count": 250 },
      { "name": "4 star", "count": 350 },
      { "name": "5 star", "count": 405 }
    ]
  },
  {
    "image": "/image/img18.png",
    "title": "Sound Boost Pro",
    "companyName": "SoundLaybari",
    "id": 120,
    "description": "Record voice notes, transcribe audio, and organize recordings with tags and folders.",
    "detailedDescription": "Sound Boost Pro delivers professional audio enhancement and recording capabilities through its advanced sound processing algorithms and intuitive user interface. The application features real-time audio enhancement that improves voice clarity, reduces background noise, and optimizes recording levels for various environments. Multi-format recording support captures audio in high-quality uncompressed formats for professional use while offering compressed options for storage efficiency. The intelligent transcription service converts speech to text with industry-leading accuracy, supporting multiple languages and specialized vocabularies for technical, medical, and legal contexts. Organization features include smart playlists, favorite marking, and automatic categorization based on content analysis. Audio editing tools provide cutting, fading, and volume normalization with batch processing for multiple files. Sharing options enable seamless distribution through various platforms with customizable quality settings. Voice enhancement features include pitch correction, tempo adjustment, and vocal effect application for creative projects. For podcasters, musicians, journalists, and business professionals, Sound Boost Pro combines studio-quality audio processing with mobile convenience, delivering exceptional recording results and powerful audio management tools that meet professional standards while remaining accessible to casual users seeking to improve their audio recording and listening experiences.",
    "size": 19.9,
    "reviews": 2100,
    "ratingAvg": 4.3,
    "downloads": "900k+",
    "ratings": [
      { "name": "1 star", "count": 35 },
      { "name": "2 star", "count": 60 },
      { "name": "3 star", "count": 250 },
      { "name": "4 star", "count": 350 },
      { "name": "5 star", "count": 405 }
    ]
  }
]